---
kind: type
id: T:Autodesk.Revit.DB.Structure.ReleaseConditions
source: html/f742770e-6b65-f237-5851-ccdf16cfc1b5.htm
---
# Autodesk.Revit.DB.Structure.ReleaseConditions

An object that represents a Release Conditions on analytical element.

## Syntax (C#)
```csharp
public class ReleaseConditions : IDisposable
```